CarlosDerSeher/snapclient/sdkconfig.defaults.esp32s3
# Additional settings for ESP32 S3
#
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=n
CONFIG_ESP_WIFI_IRAM_OPT=y
CONFIG_ESP_SYSTEM_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
CONFIG_ESP_IPC_ENABLE=y